"""
По введенным пользователем координатам двух точек вывести уравнение прямой вида y = kx + b, проходящей через эти точки.
"""

print("Введите координату #1:")
X1 = float(input('\tВведите x: '))
Y1 = float(input('\tВведите y: '))

print("Введите координату #2:")
X2 = float(input('\tВведите x: '))
Y2 = float(input('\tВведите y: '))

X_1 = X2 - X1
Y_1 = Y2 - Y1

X_2 = Y_1
Y_2 = -X_1

C = -(X_2 * X1 + Y_2 * Y1)

print("Уравнение прямой:")
print("\tОбщее уравнение прямой:")
print("\t\t%.3f*X + %.3f*Y + %.3f = 0" % (X_2, Y_2, C))

if Y_2 != 0:
    k = X_2 / Y_2
    b = C / Y_2
    print("\tВ виде 'y = kx + b':")
    print("\t\tY = %.3f*X + %.3f" % (k, b))
else:
    print("\tПрямая параллельна оси ординат, запись вида 'y = kx + b' невозможна")